<template>
    <div class="container">
        <h1>Что это такое?</h1>
        <p>Это сервис, который выполняет одну-единственную функцию &mdash; генерирует скрипт для маршрутизаторов
            <strong>MikroTik</strong> (<em>Router OS</em>), импортируя который, производится блокировка "рекламных"
            (<em>и не только</em>) доменов на основании как публичных, так и указанных вами хост-листов.</p>
        <h2 class="mt-4">Как блокируются?</h2>
        <p>До безобразия просто &mdash; все <abbr title="Domain Name System — система доменных имён">DNS</abbr> запросы
            доменов, которые проходят через маршрутизатор (<em>если он указан первым DNS сервером</em>) в случае
            соответствия с "рекламным" &mdash; перенаправляются, например, на <code>127.0.0.1</code> (<em>локальный
                хост</em>).</p>
        <blockquote class="text-muted mt-4 font-italic border-left pl-3 border-primary">
            <h4>У меня не работает / перестало работать</h4>
            <p class="small">Если ранее всё работало как надо, и <em>внезапно</em> перестало &mdash; то вероятнее всего
                это произошло по причине обновления логики работы скрипта. Поддержки старых версий нет, поэтому &mdash;
                просто обнови скрипт в маршрутизаторе (<em>возьми его обновленную версию прямо с этой страницы, его
                    исходник чуть ниже</em>). Во всех остальных случаях &mdash; есть смысл попытаться оставить
                комментарий у <a :href="blogPostLink" target="_blank">этого поста в уютном блоге</a> с подробным
                описанием что ты пытался сделать, каким образом, и что получилось в итоге.</p>
        </blockquote>
    </div>
</template>

<script>
    /* global module */
    module.exports = {
        props: {
            blogPostLink: {
                default: 'https://blog.hook.sh/mikrotik/remove-a-lot-of-ad-using-mikrotik/',
                type: String
            },
        }
    }
</script>
